
tap 'coursier/formulas'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'universal-ctags/universal-ctags'

brew 'ack'
brew 'ammonite-repl'
brew 'awscli'
brew 'bat'
brew 'clojure'
brew 'cmake'
brew 'coreutils' # Those that come with macOS are outdated
brew 'cscope'
brew 'ctags'
brew 'docker'
brew 'docker-compose'
brew 'dos2unix'
brew 'gawk'
brew 'gd'
brew 'git'
brew 'git'
brew 'global'
brew 'gnupg2'
brew 'googler'
brew 'gradle'
brew 'graphviz'
brew 'grep'
brew 'httpie'
brew 'imagemagick'
brew 'ipython'
brew 'ispell'
brew 'jenv'
brew 'jq'
brew 'jupyter'
brew 'kotlin'
brew 'leiningen'
brew 'libtool'
brew 'libvterm'
brew 'libxml2'
brew 'libxslt'
brew 'mackup'
brew 'macvim'
brew 'makedepend'
brew 'markdown'
brew 'mas'
brew 'maven'
brew 'moreutils'
brew 'node'
brew 'offlineimap'
brew 'openjpeg'
brew 'coursier/formulas/coursier', args: ['HEAD']
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'python3'
brew 'saxon'
brew 'sbt'
brew 'scala'
brew 'sqlite'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'trash'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsync'

cask 'docker'
brew 'docker-compose'
cask 'dropbox'
cask 'firefox'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'java'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'sublime-text'
cask 'tor-browser'
